#+SETUPFILE: ~/.emacs.d/org-templates/template.org
#+TITLE: Python collections ChainMap

#+NAME: importing
#+BEGIN_SRC python :results none
  from collections import ChainMap
#+END_SRC

#+BEGIN_VERSE
*ChainMap* 的主要作用是当我们需要同时访问多个字典的时候，通过 *ChainMap* 把所有字典组合起来,方便访问
#+END_VERSE

#+NAME: definition
#+BEGIN_SRC python :results none :noweb strip-export
  <<importing>>
  map0 = {"name": "inmove", "age": 30, "job": "programmer"}
  map1 = {"name": "mei", "age": 18}
  chainmap = ChainMap(map0, map1)
#+END_SRC

#+BEGIN_VERSE
1. maps: 属性,保存了所有map的列表
2. new_child(m=None): 以原有的所有的map创建一个新的ChainMap,如果m不为空则放在最前面,如果map为空,则在最前面添加一个{}
3. parents: 返回除第一个以外的所有map的列表
#+END_VERSE
#+BEGIN_SRC python :results output :noweb strip-export
  <<definition>>
  print("chainmap: {}".format(chainmap.maps))
  print("chainmap.new_child: {}".format(chainmap.new_child({"live_in": "深圳"})))
  print("chainmap.parents: {}".format(chainmap.parents))
#+END_SRC

#+RESULTS:
: chainmap: [{'name': 'inmove', 'age': 30, 'job': 'programmer'}, {'name': 'mei', 'age': 18}]
: chainmap.new_child: ChainMap({'live_in': '深圳'}, {'name': 'inmove', 'age': 30, 'job': 'programmer'}, {'name': 'mei', 'age': 18})
: chainmap.parents: ChainMap({'name': 'mei', 'age': 18})

#+BEGIN_VERSE
以下几个方面需要注意一下
1. chainmap 拥有两个maps.都有相同的name键.当我们修改chainmap中的name键的时候,map0的name会被修改,map1的name不会被修改
2. 修改chainmap中的键的值的时候,原map中的值也会相应发生变量,反之亦然.
#+END_VERSE
